###############################################
# Utilities
###############################################

cask "raycast"
cask "vlc"
cask "android-file-transfer"
# cask "logi-options-plus"
cask "stats"
cask "bitwarden"
cask "wifiman"


###############################################
# Development
###############################################

# Core apps
brew "git"
cask "docker"
cask "visual-studio-code"
cask "fork"
cask "iterm2"
brew "starship"
cask "zen-browser"

# Mobile app dev utilities
# cask "provisionql"
# cask "charles"
# cask "http-toolkit"
# cask "minisim"
# brew "codes"

# Utilities
cask "kdiff3"
brew "tlrc"
brew "jq"
brew "fzf"
brew "tree"
tap "localsend/localsend"
cask "localsend"
brew "ffmpeg"
brew "ollama"

# React-Native
# brew "rbenv"
# cask "zulu@17"
# brew "watchman"
# cask "zulu@11" # For RN v0.68
# cask "android-studio"
# cask "react-native-debugger"
# brew "scrcpy"

# Infrastructure
# cask "google-cloud-sdk"
# tap "hashicorp/tap"
# brew "hashicorp/tap/terraform"

# Python
# brew "pyenv"
# cask "pycharm-ce"

###############################################
# Personal
###############################################

cask "spotify"
cask "whatsapp"
brew "onedrive"
# cask "gimp"
# cask "messenger"

cask "font-fira-code-nerd-font"


##############################################
# VSCode plugins
###############################################

# Background / IDE utilities
vscode "asciidoctor.asciidoctor-vscode"
vscode "EditorConfig.EditorConfig"
vscode "streetsidesoftware.code-spell-checker"
vscode "naumovs.color-highlight"
vscode "artdiniz.quitcontrol-vscode"
vscode "mechatroner.rainbow-csv"
vscode "ionutvmi.path-autocomplete"

# Frontend development
vscode "formulahendry.auto-close-tag"
vscode "YoavBls.pretty-ts-errors"
vscode "codeandstuff.package-json-upgrade"
vscode "dbaeumer.vscode-eslint"
vscode "firsttris.vscode-jest-runner" # running or debugging a specific test or test-suite
vscode "Orta.vscode-jest" # running your current test-suite everytime you change it.
vscode "1YiB.svelte-bundle"

# Go
vscode "golang.Go"

# Infrastructure
vscode "hashicorp.terraform"
vscode "redhat.vscode-yaml"

# Tools
vscode "adpyke.codesnap"
vscode "pomdtr.excalidraw-editor"
vscode "ctcuff.font-preview"
vscode "tomoki1207.pdf"
vscode "jock.svg"
vscode "george-alisson.html-preview-vscode"
vscode "eriklynd.json-tools"
vscode "ryu1kn.partial-diff"
vscode "rangav.vscode-thunder-client"
vscode "ms-vsliveshare.vsliveshare"
vscode "YevhenCherkes.object-dumper"
vscode "sleistner.vscode-fileutils"

# AI / Copilot
# vscode "GitHub.copilot"
# vscode "GitHub.copilot-chat"
vscode "Continue.continue"

# Git
vscode "waderyan.gitblame"

# Markdown
vscode "yzhang.markdown-all-in-one"
vscode "yzane.markdown-pdf"
vscode "bierner.markdown-preview-github-styles"

# Themes
vscode "zhuangtongfa.material-theme"
vscode "PKief.material-icon-theme"
vscode "johnpapa.vscode-peacock"
vscode "BeardedBear.beardedtheme"
